rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Alien"], ["director", "Ridley Scott"], ["updated_at", "2016-11-21 22:01:16.402893"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def similar_movies
    @movie = Movie.find(params[:id])
    if @movie.director.blank? or @movie.director.empty?